## [ DataFrame 행/열 추가 ]

(1) 모듈 로딩

In [17]:
import pandas as pd

(2) 데이터 준비

In [18]:
# dict 타입의 데이터 생성
exam = { '이름': ['마징가', '베트맨', '홍길동', '임꺽정'],
         '국어': [98, 79, 99, 100],
         '미술': [70, 99, 87, 80],
         '수학': [80, 87, 99, 72],
         '체육': [72, 83, 90, 88]}

(3) DataFrame에 데이터 저장

In [19]:
examDF = pd.DataFrame(exam)
examDF

    이름   국어  미술  수학  체육
0  마징가   98  70  80  72
1  베트맨   79  99  87  83
2  홍길동   99  87  99  90
3  임꺽정  100  80  72  88

(4) 저장된 데이터 속성 확인

In [20]:
def printAttribute(df, dfname):
    print(f'[ {dfname} attribute ]')
    print(f'index\n===> {df.index}\n')
    print(f'columns\n===> {df.columns}\n')
    print(f'shape\n===> {df.shape}\n')
    print(f'ndim\n===> {df.ndim}\n')
    print(f'dtype\n===>\n{df.dtypes}\n')

In [22]:
printAttribute(examDF, 'examDF')

[ examDF attribute ]
index
===> RangeIndex(start=0, stop=4, step=1)

columns
===> Index(['이름', '국어', '미술', '수학', '체육'], dtype='object')

shape
===> (4, 5)

ndim
===> 2

dtype
===>
이름    object
국어     int64
미술     int64
수학     int64
체육     int64
dtype: object

(5) DataFrame에 컬럼(column) 추가
- 방법 : DF객체변수명[새로운컬럼명] = 값

In [23]:
examDF.columns

Index(['이름', '국어', '미술', '수학', '체육'], dtype='object')

In [27]:
# 행 갯수 만큼 값 추가
examDF['영어'] = [90, 89, 100, 99]
examDF

    이름   국어  미술  수학  체육   영어
0  마징가   98  70  80  72   90
1  베트맨   79  99  87  83   89
2  홍길동   99  87  99  90  100
3  임꺽정  100  80  72  88   99

In [31]:
# 1개의 데이터 즉 값 추가 시 모든 해에 동일 값으로 저장
examDF['과학'] = 10
examDF

    이름   국어  미술  수학  체육   영어  과학
0  마징가   98  70  80  72   90  10
1  베트맨   79  99  87  83   89  10
2  홍길동   99  87  99  90  100  10
3  임꺽정  100  80  72  88   99  10

In [33]:
# examDF['컴퓨터'] = [89,10]        # 리스트 크기 다름

(6) DataFrame에 행(row) 추가
- 방법 : DF객체변수명.loc[새로운 행인덱스] = [컬럼수 만큼 데이터]
- 방법 : DF객체변수명.loc[새로운 행인덱스] = 데이터
- 불가 방법 : DF객체변수명.iloc[새로운 행인덱스] = 데이터 => 데이터 존재해야 인덱스 할당

In [34]:
examDF.index

RangeIndex(start=0, stop=4, step=1)

In [42]:
# 컬럼 수 만큼의 데이터를 가진 행 추가
examDF.loc[4] = ['원더우먼', 90, 87, 99, 87, 67, 80]
examDF

     이름   국어  미술  수학  체육   영어  과학
0   마징가   98  70  80  72   90  10
1   베트맨   79  99  87  83   89  10
2   홍길동   99  87  99  90  100  10
3   임꺽정  100  80  72  88   99  10
4  원더우먼   90  87  99  87   67  80

In [44]:
# 행 추가 시 iloc는 사용불가 => 데이터 수에 맞게 인덱스 범위 지정이 되기 때문에
# 현재 인덱스에 없는 인덱스로 불가
# examDF.iloc[5] = ['슈퍼맨', 90, 87, 99, 87, 67, 80]

In [45]:
# 1개 데이터 가진 행 추가
examDF.loc[5] = '슈퍼맨'
examDF

     이름   국어   미술   수학   체육   영어   과학
0   마징가   98   70   80   72   90   10
1   베트맨   79   99   87   83   89   10
2   홍길동   99   87   99   90  100   10
3   임꺽정  100   80   72   88   99   10
4  원더우먼   90   87   99   87   67   80
5   슈퍼맨  슈퍼맨  슈퍼맨  슈퍼맨  슈퍼맨  슈퍼맨  슈퍼맨